#Область ОбработчикиСобытийЭлементовШапкиФормы


&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
		
	ДолжностьСотрудника = ОпределитьДолжность(Запись.Сотрудник);
	
	Специалист = ПолучитьЗначениеССервера();
	
	Если ДолжностьСотрудника = Специалист Тогда
	
		Элементы.ПроцентОтРабот.Видимость = Истина;
		
	Иначе 
			
		Элементы.ПроцентОтРабот.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ОпределитьДолжность(Сотрудник)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_Сотрудники.Должность
		|ИЗ
		|	Справочник.ВКМ_Сотрудники КАК ВКМ_Сотрудники
		|ГДЕ
		|	ВКМ_Сотрудники.Ссылка = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Должность;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеССервера()
	
	Специалист = Справочники.ВКМ_Должности.НайтиПоНаименованию("Специалист");
		
	Возврат Специалист;
	
КонецФункции




#КонецОбласти

