#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Процедура ЗапуститьРЗНаСервере()
	

   ИмяМетода = Метаданные.РегламентныеЗадания.ВКМ_УведомленияТГБот.ИмяМетода;

   // Проверка, выполняется ли фоновое задание по уведомлению ТГБот
   Отбор = Новый Структура;
   Отбор.Вставить("ИмяМетода", ИмяМетода);
   Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
   ФоновыеЗаданияУведомлений = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
   Если ФоновыеЗаданияУведомлений.Количество() = 0 Тогда
      НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
        НСтр("ru = 'Запуск вручную: %1'"), Метаданные.РегламентныеЗадания.ВКМ_УведомленияТГБот.Синоним);
      ФоновыеЗадания.Выполнить(ИмяМетода,,, НаименованиеФоновогоЗадания);
   КонецЕсли;

КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗапуститьОбщийМодульНаСервере()

	ВКМ_ТелеграмКлиентСервер.ВКМ_ОтправитьУведомление();

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗапуститьРЗ(Команда)
	ЗапуститьРЗНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ЗапуститьОбщийМодуль(Команда)
	ЗапуститьОбщийМодульНаСервере();
КонецПроцедуры
#КонецОбласти
