#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Отправляет уведомление в ТГБот
Процедура ВКМ_ОтправитьУведомление() Экспорт
	
	HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL);
	
	ДанныеДляЗапроса = "bot" + Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить() + "/sendMessage";
	HTTPЗапрос = Новый HTTPЗапрос(ДанныеДляЗапроса);
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Ссылка,
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	ИдентификаторГруппыДляОповещения = Константы.ВКМ_ИдентификаторГруппы.Получить();
	
	Пока Результат.Следующий() Цикл
		
		Сообщение = Новый Структура;
		Сообщение.Вставить("chat_id", ИдентификаторГруппыДляОповещения);
		Сообщение.Вставить("text", Результат.ТекстСообщения);
		
		СтрокаJSON = СтрокаJSON(Сообщение);
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
		
		Если HTTPОтвет.КодСостояния = 200 Тогда
			ДокОбъект = Результат.Ссылка.ПолучитьОбъект();
			ДокОбъект.Удалить();
		Иначе
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция СтрокаJSON(Сообщение)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Сообщение);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции


#КонецОбласти

#КонецЕсли


