Процедура ОбработкаПроведения(Отказ,Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		Если ВыборкаДетальныеЗаписи.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание 
			ИЛИ ВыборкаДетальныеЗаписи.ВКМ_ДатаНачалаДействияДоговора > ДатаПроведенияРабот
			ИЛИ ВыборкаДетальныеЗаписи.ВКМ_ДатаОкончанияДействияДоговора < ДатаПроведенияРабот Тогда
		
			СообщениеПользователю = Новый СообщениеПользователю();
			СообщениеПользователю.Текст = "Указан неверный договор";
			СообщениеПользователю.Сообщить();
			Возврат;
			
		КонецЕсли;

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	
	ЗатраченоЧасов = (ВремяОкончанияРабот - ВремяНачалаРабот) / (60*60);
	ЧасовКОплате = ?(Цел(ЗатраченоЧасов) = ЗатраченоЧасов, ЗатраченоЧасов, Цел(ЗатраченоЧасов) + 1);
	
	Движение.КоличествоЧасов = ЧасовКОплате;
	Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ВКМ_СтоимостьЧасаРаботы * Движение.КоличествоЧасов;
	
	
	КонецЦикла;
	
КонецПроцедуры