#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		Если ВыборкаДетальныеЗаписи.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание 
			ИЛИ ВыборкаДетальныеЗаписи.ВКМ_ДатаНачалаДействияДоговора > ДатаПроведенияРабот
			ИЛИ ВыборкаДетальныеЗаписи.ВКМ_ДатаОкончанияДействияДоговора < ДатаПроведенияРабот Тогда
		
			СообщениеПользователю = Новый СообщениеПользователю();
			СообщениеПользователю.Текст = "Указан неверный договор";
			СообщениеПользователю.Сообщить();
			Возврат;
			
		КонецЕсли;

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	
	ЗатраченоЧасов = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	ЧасовКОплате = ?(Цел(ЗатраченоЧасов) = ЗатраченоЧасов, ЗатраченоЧасов, Цел(ЗатраченоЧасов) + 1);
	
	Движение.КоличествоЧасов = ЧасовКОплате;
	Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ВКМ_СтоимостьЧасаРаботы * Движение.КоличествоЧасов;
	
	
	КонецЦикла;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка,
		|	ВКМ_ОбслуживаниеКлиента.Специалист,
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ЭтоНовый() Тогда
		
		УведомлениеТГ = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		УведомлениеТГ.ТекстСообщения = СтрШаблон("Новый заказ: Номер заказа %1, Клиент %2, Договор %3, Дата проведения %4, Время проведения с %5 по %6", 
													Номер, 
													Клиент, 
													Договор, 
													ДатаПроведенияРабот,
													Формат(ВремяНачалаРабот, "ДЛФ=T"),
													Формат(ВремяОкончанияРабот, "ДЛФ=T"));
		УведомлениеТГ.Записать();
	КонецЕсли;
	
	Если ВыборкаДетальныеЗаписи.ДатаПроведенияРабот <> ДатаПроведенияРабот Тогда
		
		УведомлениеТГ = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		УведомлениеТГ.ТекстСообщения = СтрШаблон("Изменена дата проведения работ. Номер заказа %1, Клиент %2, Договор %3, Дата проведения %4, Время проведения с %5 по %6", 
													Номер, 
													Клиент, 
													Договор, 
													ДатаПроведенияРабот,
													Формат(ВремяНачалаРабот, "ДЛФ=T"),
													Формат(ВремяОкончанияРабот, "ДЛФ=T"));
		УведомлениеТГ.Записать();
		
	КонецЕсли;
	 
	Если ВыборкаДетальныеЗаписи.ВремяНачалаРабот <> ВремяНачалаРабот 
		ИЛИ ВыборкаДетальныеЗаписи.ВремяОкончанияРабот <> ВремяОкончанияРабот Тогда
		
		УведомлениеТГ = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		УведомлениеТГ.ТекстСообщения = СтрШаблон("Изменено время проведения работ. Номер заказа %1, Клиент %2, Договор %3, Дата проведения %4, Время проведения с %5 по %6", 
													Номер, 
													Клиент, 
													Договор, 
													ДатаПроведенияРабот,
													Формат(ВремяНачалаРабот, "ДЛФ=T"),
													Формат(ВремяОкончанияРабот, "ДЛФ=T"));
		УведомлениеТГ.Записать();
		
	КонецЕсли;
													
	Если ВыборкаДетальныеЗаписи.Специалист <> Специалист Тогда
		
		УведомлениеТГ = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		УведомлениеТГ.ТекстСообщения = СтрШаблон("Изменен менеджер. Номер заказа %1, Клиент %2, Договор %3, Дата проведения %4, Время проведения с %5 по %6", 
													Номер, 
													Клиент, 
													Договор, 
													ДатаПроведенияРабот,
													Формат(ВремяНачалаРабот, "ДЛФ=T"),
													Формат(ВремяОкончанияРабот, "ДЛФ=T"));
		УведомлениеТГ.Записать();
		
	КонецЕсли; 

КонецПроцедуры


#КонецОбласти

#КонецЕсли