#Область ПрограммныйИнтерфейс 


// Дополняет элементы в открытую форму.
// 
// Параметры:
//  Форма - Форма - Открытая форма
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
		
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда		
		ДобавитьПоляПериодаДействия(Форма);
		ДобавитьПолеСуммаАбонентскойПлаты(Форма);
		ДобавитьПолеСтоимостьЧасаРаботы(Форма);
	КонецЕсли;
	
КонецПроцедуры


// Изменяет видимость полей формы в зависимости от значения реквизитов.
// 
// Параметры:
//  Форма - Форма - Открытая форма
Процедура ИзменитьВидимостьПолейФормы(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	ВидДоговора = Форма.Объект.ВидДоговора;
	
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда
		Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
			Форма.ЭтотОбъект.Элементы.ДатаНачалаПериодаДействия.Видимость = Истина;
			Форма.ЭтотОбъект.Элементы.ДатаОкончанияПериодаДействия.Видимость = Истина;
			Форма.ЭтотОбъект.Элементы.СуммаАбонентскойПлаты.Видимость = Истина;
			Форма.ЭтотОбъект.Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
		Иначе
			Форма.ЭтотОбъект.Элементы.ДатаНачалаПериодаДействия.Видимость = Ложь;
			Форма.ЭтотОбъект.Элементы.ДатаОкончанияПериодаДействия.Видимость = Ложь;
			Форма.ЭтотОбъект.Элементы.СуммаАбонентскойПлаты.Видимость = Ложь;
			Форма.ЭтотОбъект.Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;	
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры
 
#КонецОбласти


#Область СлужебныеПроцедурыИФункции 

Процедура ДобавитьПоляПериодаДействия(Форма);
	
	ГруппаПериодДействия = Форма.Элементы.Добавить("ГруппаПериодДействия", Тип("ГруппаФормы"));
	ГруппаПериодДействия.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериодДействия.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаПериодДействия.ОтображатьЗаголовок = Ложь;
	ГруппаПериодДействия.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ПолеВводаНачалоДействия = Форма.Элементы.Добавить("ДатаНачалаПериодаДействия", Тип("ПолеФормы"), Форма.Элементы.ГруппаПериодДействия);
	ПолеВводаНачалоДействия.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВводаНачалоДействия.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	ПолеВводаНачалоДействия.Заголовок = "Дата начала действия";
	
	Если Форма.Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ПолеВводаНачалоДействия.Видимость = Ложь;
	КонецЕсли;
	
	ПолеВводаОкончаниеДействия = Форма.Элементы.Добавить("ДатаОкончанияПериодаДействия", Тип("ПолеФормы"), Форма.Элементы.ГруппаПериодДействия);
	ПолеВводаОкончаниеДействия.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВводаОкончаниеДействия.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	ПолеВводаОкончаниеДействия.Заголовок = "Дата окончания действия";
	
	Если Форма.Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ПолеВводаОкончаниеДействия.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПолеСуммаАбонентскойПлаты(Форма);
	
	ПолеВвода = Форма.Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
	Если Форма.Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ПолеВвода.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПолеСтоимостьЧасаРаботы(Форма);
	
	ПолеВвода = Форма.Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
	Если Форма.Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ПолеВвода.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти