#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
#Область СлужебныеПроцедурыИФункции

// Получает данные договоров и реализаций по ним.
// 
// Параметры:
//  ДатаНачала - Дата -  Дата начала указанного в обработке периода
//  ДатаОкончания - Дата - Дата окончания указанного в обработке периода
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка договоров и реализаций.
Функция ПолучитьДанныеДоговоров(ДатаНачала, ДатаОкончания) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботы.Договор,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, 0) КАК Реализация,
	|	ВКМ_ВыполненныеКлиентуРаботы.Клиент КАК Контрагент,
	|	ВКМ_ВыполненныеКлиентуРаботы.Регистратор.Специалист КАК Ответственный
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО РеализацияТоваровУслуг.Договор = ВКМ_ВыполненныеКлиентуРаботы.Договор
	|		И РеализацияТоваровУслуг.Контрагент = ВКМ_ВыполненныеКлиентуРаботы.Клиент
	|ГДЕ
	|	ВКМ_ВыполненныеКлиентуРаботы.Договор.ВидДоговора = &ВидДоговора
	|	И ВКМ_ВыполненныеКлиентуРаботы.Регистратор.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВыполненныеКлиентуРаботы.Клиент,
	|	ВКМ_ВыполненныеКлиентуРаботы.Договор,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, 0),
	|	ВКМ_ВыполненныеКлиентуРаботы.Регистратор.Специалист";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;

	
	
КонецФункции


// Формирует документы РТиУ к списку договоров.
// 
// Параметры:
//  ДатаНачала - Дата -  Дата начала указанного в обработке периода
//  ДатаОкончания - Дата - Дата окончания указанного в обработке период
Процедура СформироватьРеализацииКДоговорам(ДатаНачала, ДатаОкончания) Экспорт
	
	Выборка = ПолучитьДанныеДоговоров(ДатаНачала, ДатаОкончания);
	
	ВсегоДоговоров = Выборка.Количество();
	
	Счетчик = 1;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Реализация = 0 Тогда
			
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(НовыйДокумент, Выборка);
			
			Если ДатаОкончания > ТекущаяДатаСеанса() Тогда
				НовыйДокумент.Дата = ТекущаяДатаСеанса();
			Иначе 
				НовыйДокумент.Дата = ДатаОкончания;
			КонецЕсли;
			
			НовыйДокумент.Ответственный = Ответственный;
			НовыйДокумент.Комментарий = "Документ создан программно";
			
			НовыйДокумент.ВыполнитьАвтозаполнение();
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
					
		Иначе
			
			ДокументРеализация = Выборка.Реализация.ПолучитьОбъект();
			ДокументРеализация.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
			Если ДатаОкончания > ТекущаяДатаСеанса() Тогда
				ДокументРеализация.Дата = ТекущаяДатаСеанса();
			Иначе 
				ДокументРеализация.Дата = ДатаОкончания;
			КонецЕсли;
			
			ДокументРеализация.Ответственный = Ответственный;
			ДокументРеализация.Комментарий = "Документ обновлен программно";
			
			ДокументРеализация.ВыполнитьАвтозаполнение();
			
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
		ПроцентВыполнения = (Счетчик/ВсегоДоговоров)*100;
		ПроцентВыполнения = Окр(ПроцентВыполнения, 0);
		
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, СокрЛП(Выборка.Договор));
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли