#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	
	НДФЛ = Константы.ВКМ_НДФЛ.Получить();
	
	Для Каждого ТекСтрокаСписокСотрудников из СписокСотрудников Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.НайтиПоНаименованию("Премия");
		Движение.Результат = ТекСтрокаСписокСотрудников.СуммаПремии * (1 - НДФЛ / 100);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли