#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Данные = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	ГодДокумента = Параметры.Год;
	
	ДанныеДиаграммы = Новый ТаблицаЗначений();
	
	Для Каждого Строка Из Данные Цикл
		НоваяСтрока = ДанныеДиаграммы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	ПостроитьДиаграмму(Данные, ГодДокумента);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПостроитьДиаграмму(Данные, ГодДокумента)
	
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
	ДиаграммаГанта.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Период;
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
	ДиаграммаГанта.УстановитьПолныйИнтервал(НачалоГода(ГодДокумента), КонецГода(ГодДокумента));
	

	ШкалаЭлементы = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы;

	
	ШкалаЭлементы[0].ФорматДня = ФорматДняШкалыВремени.ДеньМесяцаДеньНедели;
    ШкалаЭлементы[0].Единица = ТипЕдиницыШкалыВремени.Месяц;
	ШкалаЭлементы[0].Кратность = 1;
	ШкалаЭлементы[0].Формат = "ДФ='MMMM'";
    ШкалаЭлементы[0].ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Пунктир);
	
	ШкалаДни = ШкалаЭлементы.Добавить();
	ШкалаДни.ФорматДня = ФорматДняШкалыВремени.ДеньМесяца;
	ШкалаДни.Формат = "ДФ='dd'";
	ШкалаДни.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Пунктир);
	
	Для Каждого Строка Из Данные Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка.Сотрудник;
		
		Серия = ДиаграммаГанта.УстановитьСерию(ГодДокумента);
		Серия.Текст = Формат(ГодДокумента, "ДФ=yyyy;");
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
				
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти