#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Данные = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	ГодДокумента = Параметры.Год;
	
	ДанныеДиаграммы = Новый ТаблицаЗначений();
	
	Для Каждого Строка Из Данные Цикл
		НоваяСтрока = ДанныеДиаграммы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
//	Год = ГодДокумента;
	
	ПостроитьДиаграмму(Данные, ГодДокумента);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

//&НаКлиенте
//Процедура Уменьшить(Команда)
//	
//	Данные = ДанныеДиаграммы;
//	ГодДокумента = Год;
//	
//	ПостроитьДиаграмму(Данные, ГодДокумента);
//	
//	Элементы.ФормаУменьшить.Доступность = Ложь;
//	Элементы.ФормаУвеличить.Доступность = Истина;
//
//КонецПроцедуры
//
//&НаКлиенте
//Процедура Увеличить(Команда)
//	
//	Данные = ДанныеДиаграммы;
//	ГодДокумента = Год;
//	
//	ПостроитьПодробнуюДиаграмму(Данные, ГодДокумента);
//	
//	Элементы.ФормаУменьшить.Доступность = Истина;
//	Элементы.ФормаУвеличить.Доступность = Ложь;
//
//КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПостроитьДиаграмму(Данные, ГодДокумента)
	
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
	ДиаграммаГанта.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.ВсеДанные;
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
	ДиаграммаГанта.УстановитьПолныйИнтервал(НачалоГода(ГодДокумента), КонецГода(ГодДокумента));
	
	Шкала = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы;
	Если Шкала.Количество() > 1 Тогда
		Шкала.Удалить(ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы[1]);
	КонецЕсли;
		
	Для Каждого Строка Из Данные Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка.Сотрудник;
		
		Серия = ДиаграммаГанта.УстановитьСерию(ГодДокумента);
		Серия.Текст = Формат(ГодДокумента, "ДФ=yyyy;");
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Истина;
	
КонецПроцедуры

//&НаСервере
//Процедура ПостроитьПодробнуюДиаграмму(ДанныеДиаграммы, Год)
//	
//	ДиаграммаГанта.Обновление = Ложь;
//	ДиаграммаГанта.Очистить();
//	ДиаграммаГанта.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Период;
//	
//	Шкала = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы;
//	ШкалаДень = Шкала.Добавить();
//	ШкалаДень.Единица = ТипЕдиницыШкалыВремени.День;
//	ШкалаДень.ФорматДня = ФорматДняШкалыВремени.ДеньМесяца;
//	
//	Для Каждого Строка Из ДанныеДиаграммы Цикл
//		
//		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
//		Точка.Текст = Строка.Сотрудник;
//		
//		Серия = ДиаграммаГанта.УстановитьСерию(Год);
//		Серия.Текст = Формат(Год, "ДФ=yyyy;");
//		
//		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
//		
//		Интервал = Значение.Добавить();
//		Интервал.Начало = Строка.ДатаНачала;
//		Интервал.Конец = Строка.ДатаОкончания;
//		
//	КонецЦикла;
//	
//	ДиаграммаГанта.Обновление = Истина;
//	
//КонецПроцедуры

#КонецОбласти