#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	СформироватьДвижения();
	
	РассчитатьОсновныеНачисления();
	
	СформироватьДвиженияВзаиморасчетыССотрудниками();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения();
	
	Для Каждого Строка Из Начисления Цикл
		
		Если ТипЗнч(Строка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ОсновныеНачисления") Тогда
			
			Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ВидРасчета = Строка.ВидРасчета;
			Движение.ПериодДействияНачало = Строка.ДатаНачала;
			Движение.ПериодДействияКонец = Строка.ДатаОкончания;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.ГрафикРаботы = Строка.ГрафикРаботы;
			
		КонецЕсли;
		
//		Если ТипЗнч(Строка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда
//			
//			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
//			Движение.ПериодРегистрации = Дата;
//			Движение.ВидРасчета = Строка.ВидРасчета;
//			Движение.Сотрудник = Строка.Сотрудник;
//
//			
//		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
	
КонецПроцедуры

Процедура РассчитатьОсновныеНачисления()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК План,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник.Должность КАК Должность,
		|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОстаткиИОбороты.СуммаКОплатеКонечныйОстаток, 0) КАК ПроцентСпециалиста,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
		|	РАЗНОСТЬДАТ(ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодДействияНачало,
		|		ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодДействияКонец, ДЕНЬ) КАК КоличествоДней
		|ПОМЕСТИТЬ ВТ_НачислениеОклада
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата,) КАК
		|			ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.ОстаткиИОбороты(&НачалоПериода,
		|			&КонецПериода,,,) КАК ВКМ_ВыполненныеСотрудникомРаботыОстаткиИОбороты
		|		ПО ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОстаткиИОбороты.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НачислениеОклада.НомерСтроки КАК НомерСтроки,
		|	ВТ_НачислениеОклада.Факт КАК Факт,
		|	ВТ_НачислениеОклада.План КАК План,
		|	ВТ_НачислениеОклада.Сотрудник КАК Сотрудник,
		|	ВТ_НачислениеОклада.Оклад КАК Оклад,
		|	ВТ_НачислениеОклада.Должность КАК Должность,
		|	ВТ_НачислениеОклада.ПроцентСпециалиста КАК ПроцентСпециалиста,
		|	ВТ_НачислениеОклада.ВидРасчета КАК ВидРасчета,
		|	ВКМ_ВзаиморасчетыССотрудникамиОбороты.СуммаОборот КАК СуммаОборот,
		|	ВТ_НачислениеОклада.КоличествоДней КАК КоличествоДней
		|ПОМЕСТИТЬ ВТ_ТекущиеРасчеты
		|ИЗ
		|	ВТ_НачислениеОклада КАК ВТ_НачислениеОклада
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Обороты(&НачалоПериодаРасчета,
		|			&КонецПериодаРасчета,, Сотрудник В
		|			(ВЫБРАТЬ
		|				ВКМ_НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник
		|			ИЗ
		|				Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
		|			ГДЕ
		|				ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка)) КАК ВКМ_ВзаиморасчетыССотрудникамиОбороты
		|		ПО ВТ_НачислениеОклада.Сотрудник = ВКМ_ВзаиморасчетыССотрудникамиОбороты.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия) КАК ОтработаноДнейЗаГод,
		|	СУММА(ВКМ_ОсновныеНачисленияДанныеГрафика.Результат) КАК СуммаЗаГод
		|ПОМЕСТИТЬ ВТ_ПоказателиЗаГод
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(ПериодДействия
		|		МЕЖДУ &НачалоПериодаРасчета И &КонецПериодаРасчета) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТекущиеРасчеты.НомерСтроки КАК НомерСтроки,
		|	ВТ_ТекущиеРасчеты.Факт КАК Факт,
		|	ВТ_ТекущиеРасчеты.План КАК План,
		|	ВТ_ТекущиеРасчеты.Сотрудник КАК Сотрудник,
		|	ВТ_ТекущиеРасчеты.Оклад КАК Оклад,
		|	ВТ_ТекущиеРасчеты.Должность КАК Должность,
		|	ВТ_ТекущиеРасчеты.ПроцентСпециалиста КАК ПроцентСпециалиста,
		|	ВТ_ТекущиеРасчеты.ВидРасчета КАК ВидРасчета,
		|	ВТ_ТекущиеРасчеты.СуммаОборот КАК СуммаОборот,
		|	ВТ_ТекущиеРасчеты.КоличествоДней КАК КоличествоДней,
		|	ЕСТЬNULL(ВТ_ПоказателиЗаГод.СуммаЗаГод / ВТ_ПоказателиЗаГод.ОтработаноДнейЗаГод, 0) КАК СреднедневнаяСумма
		|ИЗ
		|	ВТ_ТекущиеРасчеты КАК ВТ_ТекущиеРасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказателиЗаГод КАК ВТ_ПоказателиЗаГод
		|		ПО ВТ_ТекущиеРасчеты.Сотрудник = ВТ_ПоказателиЗаГод.Сотрудник";
	
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Оклад", Перечисления.ВКМ_СпособРасчета.Оклад);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("НачалоПериодаРасчета", НачалоМесяца(ДобавитьМесяц(НачалоМесяца(Дата), -12)));
	Запрос.УстановитьПараметр("КонецПериодаРасчета", НачалоМесяца(Дата) - 1);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НДФЛ = Константы.ВКМ_НДФЛ.Получить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		Движение.Размер = ВыборкаДетальныеЗаписи.Оклад;
//		НДФЛ = Константы.ВКМ_НДФЛ.Получить();
		
		Если ВыборкаДетальныеЗаписи.Должность = Справочники.ВКМ_Должности.НайтиПоНаименованию("Специалист") Тогда
			
			Если ВыборкаДетальныеЗаписи.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
				
				Движение.Результат = ((Движение.Размер / ВыборкаДетальныеЗаписи.План) * ВыборкаДетальныеЗаписи.Факт 
									 + ВыборкаДетальныеЗаписи.ПроцентСпециалиста) * (1 - НДФЛ / 100);
			ИначеЕсли ВыборкаДетальныеЗаписи.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
				
				Движение.Результат = ВыборкаДетальныеЗаписи.СреднедневнаяСумма 
										* (ВыборкаДетальныеЗаписи.КоличествоДней) * (1 - НДФЛ / 100);
				
				
			КонецЕсли;
			
		Иначе
			
			Если ВыборкаДетальныеЗаписи.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			
				Движение.Результат = (Движение.Размер / ВыборкаДетальныеЗаписи.План) * ВыборкаДетальныеЗаписи.Факт 
									* (1 - НДФЛ / 100);
									
			ИначеЕсли ВыборкаДетальныеЗаписи.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
				
				Движение.Результат = ВыборкаДетальныеЗаписи.СреднедневнаяСумма
										* (ВыборкаДетальныеЗаписи.КоличествоДней) * (1 - НДФЛ / 100);
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	
КонецПроцедуры 
 
Процедура СформироватьДвиженияВзаиморасчетыССотрудниками()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисления.Результат, 0)) КАК СуммаНачислений
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.Сотрудник";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Сумма = ВыборкаДетальныеЗаписи.СуммаНачислений;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти 

#КонецЕсли

