#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	СформироватьСписокНаСервере();
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьСписок(Команда)
	СформироватьСписокНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СформироватьАкты(Команда)

	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не указан период", , "Объект.ПериодДляУказанияМесяца");
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("ДатаНачала", Объект.Период.ДатаНачала);
	ПараметрыЗапуска.Вставить("ДатаОкончания", Объект.Период.ДатаОкончания);
	
	ДлительнаяОперация = СформироватьАктыНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ОписаниеОЗавершении = Новый ОписаниеОповещения("ОписаниеОЗавершении", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры	


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьСписокНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указан период", , "Объект.ПериодДляУказанияМесяца");
		Возврат;
	КонецЕсли;
	
	Объект.СписокДоговорИРеализаций.Очистить();
	
	ДанныеЗаполнения = Обработки.ВКМ_МассовоеСозданиеАктов.ПолучитьДанныеДоговоров(Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
	
	Пока ДанныеЗаполнения.Следующий() Цикл
		
		НоваяСтрокаТЧ = Объект.СписокДоговорИРеализаций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, ДанныеЗаполнения);
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выполнено");
		
		СформироватьСписокНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры	


&НаСервере
Функция СформироватьАктыНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	
	ИмяПроцедуры = "Обработки.ВКМ_МассовоеСозданиеАктов.СформироватьРеализацииКДоговорам";
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(УникальныйИдентификатор, ИмяПроцедуры, ПараметрыЗапуска.ДатаНачала, ПараметрыЗапуска.ДатаОкончания);
	
	Возврат ДлительнаяОперация;
	
КонецФункции


#КонецОбласти

